{
    "1": [
        "Why would he?",
        "2023-02-10 20:05"
    ],
    "2": [
        "There's a dense concentration of old Soviet munitions stored in 'Transnistria' Moldova, largely artillery shells.  Presumably, Russia would want to take those to feed hungry artillery tubes.  Destruction of the stockpiles would remove one reason for invasion of Moldova, and maybe not make it a near-term priority for RF.  \nPersonally, I think it's the equivalent of 'sweaty dynamite', some of it is unstable, some has rusted/rotted, and a lot of it is possibly usable. The trick is to determine which is which without it blowing up at any point before it's completely left a gun barrel.",
        "2023-02-10 20:05"
    ],
    "3": [
        "I used to live nearby. They would often, and probably still do, fly these things over town at super low altitude. You could even catch a glimpse of the pilots silhouettes sometimes. \n\nFun fact: This base was training Afghani pilots one time and the dudes went AWOL. Not sure if they ever found them lol",
        "2023-02-10 20:05"
    ],
    "4": [
        "He had the “stop”, he had the “drop”, and I guess he did the “roll.”",
        "2023-02-10 20:04"
    ],
    "5": [
        "Fair question, and it's always good to vet an organization before donating! But I'm sure you understand why we're not fundraising for tanks or planes on Reddit. ;)  \n\n\nDrones are something that a civilian has access to buy, and they are the most requested item from the units who we deliver supplies to. We do have an Amazon wishlist also so people can buy them directly rather than donating $ but many donors can't afford to buy a whole one. Drones are not the only thing we fundraise for - at Ukraine Aid Ops we supply military units with medical supplies, helmets and body armour, secure radios, cold weather gear such as sleeping bags/winter boots/thermal underwear/etc. There are many gaps that need to be filled, unfortunately.  \n\n\nI invite you to check out our webpage at [https://ukraineaidops.org/donate/](https://ukraineaidops.org/donate/), and our Twitter feed where we post photos/videos of each delivery to the front lines. We do our best to be transparent and are happy to answer any questions. We are also an approved charity on the r/ukraine charity list.",
        "2023-02-10 20:04"
    ],
    "6": [
        "first the leo2 tanks now this - next time better not lean out of the window.",
        "2023-02-10 20:04"
    ],
    "7": [
        "It’s funny how you all believe that Romania somehow has better working radars than Ukraine, despite Ukraine managing a 85% missile interception rate and being in war and being attacked by thousands of missiles overall.\n\nYou haven’t wondered how can Ukraine be able to manage to intercept so many missiles with faulty equipment? \n\nI am amazed how quickly you believe Romania’s words over Ukraine’s…",
        "2023-02-10 20:04"
    ],
    "8": [
        "I THINK what we see here is a thick dark line where Russia used a mine clearing vehicle to clear a path through a minefield.  They then attempted to send a column through that constricted path.  In WW II or Syria this might work as there is/was limited aerial surveillance.  One might be able to punch through before anyone noticed.  Much like take 2 days to build a bridge in a remote area of a river and attempt to cross.  In UA with all the drones and satellites it is a massacre.",
        "2023-02-10 20:04"
    ],
    "9": [
        "Hmm. A bunch of neo-nazi Ukrainians lead by a Jew, with Muslim leader and free Chechen troops defending Ukraine together with them? 🤔\n\nMy God those nazis really go to extreme lengths this time. Who knows what'll happen next. Maybe there'll be one running Kremlin.",
        "2023-02-10 20:04"
    ],
    "10": [
        "Russia has been below replacement birth rates for ages. They still have the echo from WWii where those who died never got to have kids. The American Baby Boomers grew in an era of unprecedented prosperity after the Great Depression and WWii left the competition in literally rebuilding.",
        "2023-02-10 20:04"
    ]
}