{
    "1": [
        "Your submission has been removed because it is from an untrustworthy site. If you have any questions, contact the mods via modmail, [clicking here](/message/compose?to=%2Fr%2Fukraine&amp;subject=Untrustworthy%20link&amp;message=). Please make sure to include a link to the comment/post in question.\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ukraine) if you have any questions or concerns.*",
        "2023-02-10 19:56"
    ],
    "2": [
        "Why do you assume Romanian radar’s are better than Ukraine’s? Ukraine has received thousands of missiles and excels at intercepting them. How can they manage to intercept missiles with faulty equipment that is off by several kms?",
        "2023-02-10 19:55"
    ],
    "3": [
        "Fighter aircraft could launch anti ship missiles and kill cruise missiles and drones with missiles or even guns.  Ukraine 🇺🇦 needs moderns fighters and lots more tanks, LR rockets, artillery and ammunition.   \n\nДо біса ти окупант.  Слава Україні.  Героям слава.  Смерть ворогам.  Хай Бог береже Святу Україну.",
        "2023-02-10 19:55"
    ],
    "4": [
        "Not until you unlock the mlrs systems from hitting inside Russia to take out their long range AA missile systems...",
        "2023-02-10 19:55"
    ],
    "5": [
        "TBH, this is being reported multiple times from the same statement from Ukraine.  Romania’s MoD has already confirmed Moldovan airspace violation, but categorically refuted a breach of Romanian airspace.",
        "2023-02-10 19:55"
    ],
    "6": [
        "\nПривіт u/Hefty-Relationship-8 ! During wartime, this community is focused on vital and high-effort content.  Please ensure your post follows [r/Ukraine Rules](https://www.reddit.com/r/ukraine/about/rules) and our [Art Friday Guidelines](https://www.reddit.com/r/ukraine/wiki/artfriday).\n\n**Want to support Ukraine?** [**Vetted Charities List**](https://www.reddit.com/r/ukraine/wiki/charities) | [Our Vetting Process](https://www.reddit.com/r/ukraine/wiki/charities-vetting)\n\nDaily series on UA history &amp; culture: [Day 0-99](https://new.reddit.com/r/ukraine/collection/3c65ab52-e87a-4217-ab30-e70a88c0a293) | [100-199](https://new.reddit.com/r/ukraine/collection/3d85f4ca-5f4e-4ddf-9547-276e8affd87c) | [200-Present](https://new.reddit.com/r/ukraine/collection/daf642e1-07aa-4c40-b852-8f002ddd1530) | [All By Subject](https://new.reddit.com/r/ukraine/wiki/sunriseposts)\n\n**There is a new wave of t-shirt scams hitting Reddit. Only click links for products or donations if the post is marked with a Verified flair, and do not respond to DMs soliciting donations.**\n***\n\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/ukraine) if you have any questions or concerns.*",
        "2023-02-10 19:55"
    ],
    "7": [
        "…. In the 1970s. \n\nAA and SAM technology has come a long way since the A10 first entered service. \n\nIt would be hopelessly vulnerable over Ukraine in anything other than total air supremacy. \n\nThe S400 alone would drop A10s like flies. \n\nThis ain’t Afghanistan.",
        "2023-02-10 19:55"
    ],
    "8": [
        "[removed]",
        "2023-02-10 19:55"
    ],
    "9": [
        "[removed]",
        "2023-02-10 19:55"
    ],
    "10": [
        "Ukraine wants a combination of Ukrainian pilots and contractor pilots.\nThat way a bigger punch is packed",
        "2023-02-10 19:55"
    ]
}