{
    "1": [
        "IPhone only?",
        "2023-02-13 13:33"
    ],
    "2": [
        "You should try audiobooks. You can download them free from most libraries using an app called Libby.",
        "2023-02-13 00:39"
    ],
    "3": [
        "Hmm that’s weird, it should be this one. I think it’s case sensitive so maybe copy/paste : LTPrHzDKuI",
        "2023-02-12 23:36"
    ],
    "4": [
        "Code don’t work",
        "2023-02-12 23:33"
    ],
    "5": [
        "Hello /u/SuperTemp716, it looks like you're submitting from a new/young account. To reduce Spam on this sub, all post submissions need to be made from an account older than 5 days. You are welcome to use the search feature to find a similar past thread, or wait until your account is a little older to post again. Why not use the wait time to join in with what others have to say?\n\n*I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/walking) if you have any questions or concerns.*",
        "2023-02-12 22:29"
    ],
    "6": [
        "I have been impressed with the UA map my walk results. I walk a path around a lake everyday and it does a great job of sticking to my path, including a side step to fix my shoes this morning. I’m still only doing 3 miles a day, so it showing 3 wiggly rings around the lake and then the hook back to my car",
        "2023-02-12 22:23"
    ],
    "7": [
        "How did I not know this existed?! Thank you!",
        "2023-02-12 22:19"
    ],
    "8": [
        "I have MapMyWalk that saves where I’ve walked",
        "2023-02-12 22:05"
    ],
    "9": [
        "You might look into the American Discovery Trail. Dave Whitson does a great podcast about the Camino de Santiago, and has walked a lot around Europe, but in 2020 he set out to walk the ADT. Covid, unsurprisingly, unraveled much of his plan, but he did get some of it done before he had to end the trek. It sounds like it might be worth your time to dig a bit into it.",
        "2023-02-12 06:44"
    ],
    "10": [
        "This is also on my list of \"random shit I'd do if I won the lottery,\" right underneath \"kayak the Mississippi river.\" Hope you can make it work!",
        "2023-02-11 17:32"
    ]
}